Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch
Bend profile contains more than one loop. Cannot create a bent fabric sheet.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetLinesOverlapOrIntersect
Bend profile contains an overlap or intersects segments. Cannot create a bent fabric sheet.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetInvalidElementInSketch
Bend profiles can only contain lines and single arcs divided by a line.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetEmptySketch
Bend profile is empty. Cannot create a bent fabric sheet.

Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch
Bend profile contains a closed loop. Cannot create a bent fabric sheet.